In [1]:
import pandas as pd

In [2]:
big = pd.DataFrame({'department':['A','A','B','B'], 'gender':['male','female','male','female'],'count':[1,2,3,1]})
small = pd.DataFrame({'department':['A','B'], 'total':[3,4]})

In [3]:
display("big",big)
display("small",small)

'big'

  department  gender  count
0          A    male      1
1          A  female      2
2          B    male      3
3          B  female      1

'small'

  department  total
0          A      3
1          B      4

In [12]:
pd.merge(big,small) 
big.merge(small)
pd.merge(small,big) 
small.merge(big)

  department  total  gender  count
0          A      3    male      1
1          A      3  female      2
2          B      4    male      3
3          B      4  female      1

In [16]:
big.merge(small,on='department')

  department  gender  count  total
0          A    male      1      3
1          A  female      2      3
2          B    male      3      4
3          B  female      1      4

`-` 망하는 경우

In [71]:
big = pd.DataFrame({'department':['A','A','B','B'], 'gender':['male','female','male','female'],'count':[1,2,3,1]})
small = pd.DataFrame({'department':['A','B'], 'count':[3,4]})
display("big",big)
display("small",small)

'big'

  department  gender  count
0          A    male      1
1          A  female      2
2          B    male      3
3          B  female      1

'small'

  department  count
0          A      3
1          B      4

In [34]:
big.merge(small)

Empty DataFrame
Columns: [department, gender, count]
Index: []

In [37]:
big.merge(small,on='department')
pd.merge(big,small,on='department')

  department  gender  count_x  count_y
0          A    male        1        3
1          A  female        2        3
2          B    male        3        4
3          B  female        1        4

`-` 이는 아래의 코드와 같다.

In [38]:
pd.merge(big,small,left_on='department',right_on='department')

  department  gender  count_x  count_y
0          A    male        1        3
1          A  female        2        3
2          B    male        3        4
3          B  female        1        4

`-` 왜 이런게 필요할까?

In [72]:
big = pd.DataFrame({'department':['A','A','B','B'], 'gender':['male','female','male','female'],'count':[1,2,3,1]})
small = pd.DataFrame({'dept':['A','B'], 'count':[3,4]})
display("big",big)
display("small",small)

'big'

  department  gender  count
0          A    male      1
1          A  female      2
2          B    male      3
3          B  female      1

'small'

  dept  count
0    A      3
1    B      4

In [74]:
pd.merge(big,small)

  department gender  count dept
0          B   male      3    A

In [76]:
pd.merge(big,small,left_on='department',right_on='dept')

  department  gender  count_x dept  count_y
0          A    male        1    A        3
1          A  female        2    A        3
2          B    male        3    B        4
3          B  female        1    B        4

In [170]:
pd.merge(big,small,left_on='department',right_on='dept')

  department  gender  count_x dept  count_y
0          A    male        1    A        3
1          A  female        2    A        3
2          B    male        3    B        4
3          B  female        1    B        4

`# 예제2`

In [182]:
df1 = pd.DataFrame({
    'dept':['통계','수학','과학','IAB'], 
    'count':[20,30,25,50]
})
df2 = pd.DataFrame({
    'dept':['통계','수학','과학','신설학과'], 
    'desc':['통계학과는...','수학과는...','과학학과는...','이 학과는 내년에 신설되 예정이고...']
})
display("df1",df1)
display("df2",df2)

'df1'

  dept  count
0   통계     20
1   수학     30
2   과학     25
3  IAB     50

'df2'

   dept                   desc
0    통계               통계학과는...
1    수학                수학과는...
2    과학               과학학과는...
3  신설학과  이 학과는 내년에 신설되 예정이고...

In [186]:
pd.merge(df1,df2,how='outer')

   dept  count                   desc
0    통계   20.0               통계학과는...
1    수학   30.0                수학과는...
2    과학   25.0               과학학과는...
3   IAB   50.0                    NaN
4  신설학과    NaN  이 학과는 내년에 신설되 예정이고...

In [176]:
df2023 = pd.DataFrame({
    'name':['최규빈']*3+['최혜미']*2+['이영미']+['양성준'],
    'year':[2023]*7,
    'course':['파이썬프로그래밍', '데이터시각화', '기계학습활용','수리통계1', '수리통계2','회귀분석1','통계수학']})
df2023

  name  year    course
0  최규빈  2023  파이썬프로그래밍
1  최규빈  2023    데이터시각화
2  최규빈  2023    기계학습활용
3  최혜미  2023     수리통계1
4  최혜미  2023     수리통계2
5  이영미  2023     회귀분석1
6  양성준  2023      통계수학

In [177]:
df2024 = pd.DataFrame({
    'name':['최규빈','이영미','이영미','양성준','최혜미'],
    'year':[2024]*5,
    'course':['기계학습활용','수리통계1', '수리통계2','회귀분석1','통계수학']})
df2024

  name  year  course
0  최규빈  2024  기계학습활용
1  이영미  2024   수리통계1
2  이영미  2024   수리통계2
3  양성준  2024   회귀분석1
4  최혜미  2024    통계수학

In [189]:
df_성별정보 = pd.DataFrame({'name':['최규빈','이영미','양성준','최혜미'],
                        'sex':['male','female','male','female']})
df_성별정보

  name     sex
0  최규빈    male
1  이영미  female
2  양성준    male
3  최혜미  female

In [194]:
df_score = pd.DataFrame({
    'name':['최규빈','최규빈','이영미','이영미','양성준','양성준','최혜미','최혜미'],
    'year':[2023,2024]*4,
    'score':[1, 1.2, 5,5,5,5,5,5]})

In [195]:
df_score

  name  year  score
0  최규빈  2023    1.0
1  최규빈  2024    1.2
2  이영미  2023    5.0
3  이영미  2024    5.0
4  양성준  2023    5.0
5  양성준  2024    5.0
6  최혜미  2023    5.0
7  최혜미  2024    5.0

In [203]:
pd.concat([df2023,df2024]).merge(df_score,on=['name','year']).merge(df_성별정보,on='name')

   name  year    course  score     sex
0   최규빈  2023  파이썬프로그래밍    1.0    male
1   최규빈  2023    데이터시각화    1.0    male
2   최규빈  2023    기계학습활용    1.0    male
3   최규빈  2024    기계학습활용    1.2    male
4   최혜미  2023     수리통계1    5.0  female
5   최혜미  2023     수리통계2    5.0  female
6   최혜미  2024      통계수학    5.0  female
7   이영미  2023     회귀분석1    5.0  female
8   이영미  2024     수리통계1    5.0  female
9   이영미  2024     수리통계2    5.0  female
10  양성준  2023      통계수학    5.0    male
11  양성준  2024     회귀분석1    5.0    male

In [178]:
pd.merge(df2023,df2024,on=['name'],how='outer').set_index(['name','gender'])

KeyError: "None of ['gender'] are in the columns"

In [ ]:
pd.merge(df2023,df2024,on='name')

,name,geder,course_x,age,course_y
0,최규빈,male,"파이썬프로그래밍(2023), 데이터시각화(2023), 기계학습활용(2023)",1,기계학습활용(2024)
1,최혜미,female,"수리통계1(2023), 수리통계2(2023)",4,"수리통계1(2024), 수리통계2(2024)"
2,이영미,female,회귀분석1(2023),2,회귀분석1(2024)
3,양성준,male,통계수학(2023),3,통계수학(2024)

In [ ]:
df2024 = pd.DataFrame({
    'name':['최혜미','이영미','양성준','새교수님1','새교수님2'],
    'course':['수리통계1(2024), 수리통계2(2024)','회귀분석1(2024)','통계수학(2024)','파이썬프로그래밍(2024), 데이터시각화(2024)','기계학습활용(2024)']})
df2024

    name                        course
0    최혜미      수리통계1(2024), 수리통계2(2024)
1    이영미                   회귀분석1(2024)
2    양성준                    통계수학(2024)
3  새교수님1  파이썬프로그래밍(2024), 데이터시각화(2024)
4  새교수님2                  기계학습활용(2024)

In [ ]:
pd.merge(df2023,df2024,on='name',how='outer')

,name,geder,course_x,course_y
0,최규빈,male,"파이썬프로그래밍(2023), 데이터시각화(2023), 기계학습활용(2023)",NaN
1,최혜미,female,"수리통계1(2023), 수리통계2(2023)","수리통계1(2024), 수리통계2(2024)"
2,이영미,female,회귀분석1(2023),회귀분석1(2024)
3,양성준,male,통계수학(2023),통계수학(2024)
4,새교수님1,NaN,NaN,"파이썬프로그래밍(2024), 데이터시각화(2024)"
5,새교수님2,NaN,NaN,기계학습활용(2024)

---